## Part 1 (Basics, strings, lists, tuples, dictionaries)

In [ ]:
#Q1

In [15]:
import re

In [20]:
def convert(s):
    return re.findall(r"[\w']+", s)

In [21]:
str = 'ajit.singh@transorg.com'

In [22]:
convert(str)

['ajit', 'singh', 'transorg', 'com']

In [ ]:
#Q2

In [23]:
l1 = [1,2,3,4,5,6]    
l2 = [2,3,4,7,8]

In [24]:
list(set(l1) & set(l2))

[2, 3, 4]

In [ ]:
# Q3

In [28]:
l1 = [1,2,2,1,3,4]

In [29]:
list(set(l1))

[1, 2, 3, 4]

In [ ]:
#Q4

In [30]:
l1= [100,101,102,103,104,105]

In [31]:
new_list = set(l1)
new_list.remove(max(new_list))

In [32]:
print(max(new_list))

104

In [ ]:
#Q5

In [33]:
d = {1:2,2:3,3:4}

In [34]:
list = [(a, b) for a, b in d.items()]

In [35]:
print(list)

[(1, 2), (2, 3), (3, 4)]

## Part 2 (Lambda Functions)

In [ ]:
#Q1

In [36]:
l1= [1,2,3,4,5,6,7,8,9]

In [37]:
squared = map(lambda x: x * x, l1)

In [40]:
for num in squared:
    print(num)

1
4
9
16
25
36
49
64
81

In [41]:
#Q2

In [45]:
min = (lambda x, y: x if x < y else y)

In [50]:
min(2,3)

2

## Part 3 (Pandas DataFrames):

In [61]:
import pandas as pd
import numpy as np
dict1 = {'ID':[1,2,3,4,5],'Name':['Alpha','Bravo','Charlie','Delta','Echo']}

dict2 = {'ID':[2,2,5,3,1,1,4,4],'Sport':['Cricket','Football','Basketball','Basketball','Table tennis','Cricket','Football','Basketball']}

dict3 = {'ID':[2,1,3,5,4], 'Marks':[30,' ',85,65,97]}

In [62]:
df1 = pd.DataFrame(data = dict1)
df2 = pd.DataFrame(data = dict2)

In [63]:
df3=pd.DataFrame(data = dict3)

df3['Marks']=np.where(df3['ID']==1,np.nan,df3['Marks'])

In [73]:
df1

   ID     Name
0   1    Alpha
1   2    Bravo
2   3  Charlie
3   4    Delta
4   5     Echo

In [72]:
df2

   ID         Sport
0   2       Cricket
1   2      Football
2   5    Basketball
3   3    Basketball
4   1  Table tennis
5   1       Cricket
6   4      Football
7   4    Basketball

In [74]:
df3

   ID Marks
0   2    30
1   1   NaN
2   3    85
3   5    65
4   4    97

In [75]:
#merging table 1 and table 2

merge_df_1 = pd.merge(df1, df2, how ='inner', on ='ID')

In [77]:
merge_df_1

   ID     Name         Sport
0   1    Alpha  Table tennis
1   1    Alpha       Cricket
2   2    Bravo       Cricket
3   2    Bravo      Football
4   3  Charlie    Basketball
5   4    Delta      Football
6   4    Delta    Basketball
7   5     Echo    Basketball

In [79]:
# Q2 Find the number of ID’s having marks greater than 80. 
#Also, find the maximum and minimum values of the column “Marks” in table 3

In [81]:
#the number of ID’s having marks greater than 80
df3.loc[(df3['Marks'] >= 80)]

   ID Marks
2   3    85
4   4    97

In [90]:
#the number of ID’s having marks greater than 80

id_80 = df3.loc[(df3['Marks'] >= 80)]['ID']

print('the number of ID’s having marks greater than 80 : \n',id_80.to_string(index=False))

the number of ID’s having marks greater than 80 :
 3
4

In [92]:
#find the maximum and minimum values of the column “Marks” in table 3

max = df3['Marks'].max()
min = df3['Marks'].min()

In [93]:
print( ' max marks:', max)
print( ' min marks:', min)

 max marks: 97
 min marks: 30